/*
---------------------------------------------------------
| 类型名         字节数         位数        数据范围    |
--------------------------------------------------------|
| short        2字节        00   16    (-2^15 -> 2^15-1)|   -32768 -> 32767
| int          4字节      0000   32    (-2^31 -> 2^31-1)|      21亿
| long    (win)4字节      0000   32    (-2^31 -> 2^31-1)|      21亿
|              8字节  00000000   64    (-2^63 -> 2^63-1)|      19位十进制数
| long long    8字节  00000000   64    (-2^63 -> 2^63-1)|      19位十进制数
---------------------------------------------------------

short <= int <= long <= long long
*/
#include <stdio.h>

int main() {
    short a = 32769;
    int b = 2147483648;
    long c = 1L;// 如果常量在 int 范围内，不加 L 时通常会被推断为 int；
    // 超出 int 范围时，编译器会自动推断为 long。
    long long d = 1LL;
    printf("%hd\n", a);// -32767
    printf("%hu\n", a);// 32769

    printf("%d\n", b);
    printf("%ld\n", c);
    printf("%lld\n", d);

    return 0;
}
